In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Feature Engineering**
- so far we have performed feature analysis
    - DataFrame quick checks
    - categorical column anlaysis
    - Bar charts , pie charts
    - Numerical columns anlysis
    - Histograms, boxplots,outliers
    - Bi and multi variate anlysis
    - correlation etc

- **New we need to learn the Feature Engineering**
    - we will create a new columns
    - we will perform the **encoding**, which converts the categorical data to numerical data
    - we will do **data transformations**
    - we will perform scaling of the data called **standardizationa and normalization**
    - we will perform the **missing value anlysis**

- simply feature engineering means our data is modifying

In [24]:
visa_df=pd.read_csv(r'C:\Users\RavindharRajula\NareshIT\Data_set_files\Visadataset.csv')
visa_df.head(2)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified

In [25]:
cat_cols=visa_df.select_dtypes(include='object').columns
cat_cols

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [26]:
num_cols = visa_df.select_dtypes(exclude='object').columns
num_cols

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

- feature anlaysis
- feature engineering
- feature selection
- model development
- model evaluation
- model tuning
- deployment

## Encoding : 
- **converting categorical to numerical data**
- ML or DL or any models works based on maths.
- models cannot understand the english characters
- so it is very important to convert categorical label to numerical label
- for example gender column has 2 labels male and female , then female represent 0 and male represent 1 based on alpabetical orders.

In [27]:
visa_df['case_status'].unique()

array(['Denied', 'Certified'], dtype=object)

In [28]:
# Certifed should assign as 0
# Denied should assign as 1 

d={'Certified' : 0,'Denied' : 1}
d

{'Certified': 0, 'Denied': 1}

In [29]:
visa_df.case_status=visa_df.case_status.map(d)

In [30]:
visa_df.head(3)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1

In [31]:
# continent
labels=sorted(visa_df['continent'].unique())
labels

['Africa', 'Asia', 'Europe', 'North America', 'Oceania', 'South America']

In [32]:
d1={}
for i in range(len(labels)):
    d1[labels[i]]=i
d1

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [33]:
visa_df.continent=visa_df.continent.map(d1)

In [34]:
visa_df.head()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,1,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0
2,EZYV03,1,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,1
3,EZYV04,1,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,1
4,EZYV05,0,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,0

In [37]:
d11={j:i for i,j in enumerate(labels)}   #usin enumerate
d11

{'Africa': 0,
 'Asia': 1,
 'Europe': 2,
 'North America': 3,
 'Oceania': 4,
 'South America': 5}

In [38]:
for k in cat_cols[1:]:
    labels=sorted(visa_df[k].unique())
    d={j:i for i,j in enumerate(labels)}
    visa_df[k]=visa_df[k].map(d)

In [41]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

## Label Encoder

- label encoder is a method will conert the categorical variables to numerical variables
- it is under the package **sklearn** (sickit-learn)
- the class name is **preprocessing**
- the method name is **LabelEncoder**

In [42]:
from sklearn.preprocessing import LabelEncoder

In [ ]:
# import the method
# save the method
# apply fit transform
# fit_transform : 
     # - fit : means find the logic   ex: creating mapper or dictionary in above method.

     # - transform : means apply logic and change the data.    ex: apply the mapper(dict) to dataframe(data)

In [43]:
visa_df=pd.read_csv(r'C:\Users\RavindharRajula\NareshIT\Data_set_files\Visadataset.csv')
visa_df.head(2)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified

In [44]:
le=LabelEncoder()

In [47]:
visa_df.case_status=le.fit_transform(visa_df.case_status)

In [48]:
visa_df.head(2)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,1
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,0

In [49]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
visa_df.continent=le.fit_transform(visa_df.continent)

In [54]:
visa_df.continent.unique()

array([1, 0, 3, 2, 5, 4])

In [56]:
visa_df=pd.read_csv(r'C:\Users\RavindharRajula\NareshIT\Data_set_files\Visadataset.csv')
visa_df.head(2)
cat_cols=visa_df.select_dtypes(include='object').columns
cat_cols

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [58]:
for i in cat_cols[1:]:
    visa_df[i]=le.fit_transform(visa_df[i])

In [59]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,1,2,0,0,14513,2007,4,592.2029,0,1,1
1,EZYV02,1,3,1,0,2412,2002,2,83425.6500,3,1,0
2,EZYV03,1,0,0,1,44444,2008,4,122996.8600,3,1,1
3,EZYV04,1,0,0,0,98,1897,4,83434.0300,3,1,1
4,EZYV05,0,3,1,0,1082,2005,3,149907.3900,3,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,1,0,1,1,2601,2008,3,77092.5700,3,1,0
25476,EZYV25477,1,2,1,0,3274,2006,2,279174.7900,3,1,0
25477,EZYV25478,1,3,1,0,1121,1910,3,146298.8500,3,0,0
25478,EZYV25479,1,3,1,1,1918,1887,4,86154.7700,3,1,0
25479,EZYV25480,1,0,1,0,3195,1960,1,70876.9100,3,1,0

## OneHotEncoder
- first how many labels are there in a column that many new columns will be created extra.
- for example case_staus has 2 labels (certified,denied) so, it will create 2 columns extra
- columns looks 'case_status_Certifed' and 'case_status_Denied'
- At a time one column value become 1 and other column value become 0.**This means OneHotEncoder**
|continent| continent_Asia | continent_Eruope | continent_Africa|
|-|-|-|-|
|Asia|1|0|0|
|Europe|0|1|0|
|Africa|0|0|1|

### pd.get_dummies

In [63]:
visa_df=pd.read_csv(r'C:\Users\RavindharRajula\NareshIT\Data_set_files\Visadataset.csv')
pd.get_dummies(visa_df['continent'],dtype=int)

       Africa  Asia  Europe  North America  Oceania  South America
0           0     1       0              0        0              0
1           0     1       0              0        0              0
2           0     1       0              0        0              0
3           0     1       0              0        0              0
4           1     0       0              0        0              0
...       ...   ...     ...            ...      ...            ...
25475       0     1       0              0        0              0
25476       0     1       0              0        0              0
25477       0     1       0              0        0              0
25478       0     1       0              0        0              0
25479       0     1       0              0        0              0

[25480 rows x 6 columns]